Revit 2027 API
StructuralSection.StructuralSectionShapeName Property
 A human readable string representing the structural section shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string StructuralSectionShapeName { get; }
Public ReadOnly Property StructuralSectionShapeName As String
	Get
public:
property String^ StructuralSectionShapeName {
	String^ get ();
}
member StructuralSectionShapeName : string with get
Property Value
String
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace